Revit 2027 API
RebarBarType.BarNominalDiameter Property
 Defines bar nominal diameter of rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarNominalDiameter { get; set; }
Public Property BarNominalDiameter As Double
	Get
	Set
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
member BarNominalDiameter : float with get, set
Property Value
Double
 The bar nominal diameter of rebar
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: the bar diameter barNominalDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter, standard hook bend diameter and stirrup/tie bend diameter
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace